Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 48, 48, 3)]  0                                            
__________________________________________________________________________________________________
onet_permute (Permute)          (None, 48, 48, 3)    0           input_1[0][0]                    
__________________________________________________________________________________________________
onet_conv_1 (Conv2D)            (None, 46, 46, 32)   896         onet_permute[0][0]               
__________________________________________________________________________________________________
onet_prelu_1 (PReLU)            (None, 46, 46, 32)   32          onet_conv_1[0][0]                
__________________________________________________________________________________________________
onet_maxpool_1 (MaxPooling2D)   (None, 23, 23, 32)   0           onet_prelu_1[0][0]               
__________________________________________________________________________________________________
onet_conv_2 (Conv2D)            (None, 21, 21, 64)   18496       onet_maxpool_1[0][0]             
__________________________________________________________________________________________________
rnet_prelu_2 (PReLU)            (None, 21, 21, 64)   64          onet_conv_2[0][0]                
__________________________________________________________________________________________________
onet_maxpool_2 (MaxPooling2D)   (None, 10, 10, 64)   0           rnet_prelu_2[0][0]               
__________________________________________________________________________________________________
onet_conv_3 (Conv2D)            (None, 8, 8, 64)     36928       onet_maxpool_2[0][0]             
__________________________________________________________________________________________________
onet_prelu_3 (PReLU)            (None, 8, 8, 64)     64          onet_conv_3[0][0]                
__________________________________________________________________________________________________
onet_maxpool_3 (MaxPooling2D)   (None, 4, 4, 64)     0           onet_prelu_3[0][0]               
__________________________________________________________________________________________________
onet_conv_4 (Conv2D)            (None, 3, 3, 128)    32896       onet_maxpool_3[0][0]             
__________________________________________________________________________________________________
onet_prelu_4 (PReLU)            (None, 3, 3, 128)    128         onet_conv_4[0][0]                
__________________________________________________________________________________________________
onet_flatten (Flatten)          (None, 1152)         0           onet_prelu_4[0][0]               
__________________________________________________________________________________________________
oenet_dense (Dense)             (None, 256)          295168      onet_flatten[0][0]               
__________________________________________________________________________________________________
onet_prelu_5 (PReLU)            (None, 256)          256         oenet_dense[0][0]                
__________________________________________________________________________________________________
output_1 (Dense)                (None, 2)            514         onet_prelu_5[0][0]               
__________________________________________________________________________________________________
output_2 (Dense)                (None, 4)            1028        onet_prelu_5[0][0]               
__________________________________________________________________________________________________
output_3 (Dense)                (None, 10)           2570        onet_prelu_5[0][0]               
==================================================================================================
Total params: 389,040
Trainable params: 389,040
Non-trainable params: 0
__________________________________________________________________________________________________
