Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, None,  0                                            
__________________________________________________________________________________________________
pnet_permute_1 (Permute)        (None, None, None, 3 0           input_1[0][0]                    
__________________________________________________________________________________________________
pnet_conv_1 (Conv2D)            (None, None, None, 1 280         pnet_permute_1[0][0]             
__________________________________________________________________________________________________
prelu_1 (PReLU)                 (None, None, None, 1 10          pnet_conv_1[0][0]                
__________________________________________________________________________________________________
pnet_maxpool_1 (MaxPooling2D)   (None, None, None, 1 0           prelu_1[0][0]                    
__________________________________________________________________________________________________
pnet_conv_2 (Conv2D)            (None, None, None, 1 1456        pnet_maxpool_1[0][0]             
__________________________________________________________________________________________________
prelu_2 (PReLU)                 (None, None, None, 1 16          pnet_conv_2[0][0]                
__________________________________________________________________________________________________
pnet_conv_3 (Conv2D)            (None, None, None, 3 4640        prelu_2[0][0]                    
__________________________________________________________________________________________________
prelu_3 (PReLU)                 (None, None, None, 3 32          pnet_conv_3[0][0]                
__________________________________________________________________________________________________
pnet_branch_a (Conv2D)          (None, None, None, 2 66          prelu_3[0][0]                    
__________________________________________________________________________________________________
softmax (Softmax)               (None, None, None, 2 0           pnet_branch_a[0][0]              
__________________________________________________________________________________________________
pnet_branch_b (Conv2D)          (None, None, None, 4 132         prelu_3[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_transpose (TensorFl [(None, None, None,  0           softmax[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_transpose_1 (Tensor [(None, None, None,  0           pnet_branch_b[0][0]              
==================================================================================================
Total params: 6,632
Trainable params: 6,632
Non-trainable params: 0
__________________________________________________________________________________________________
