Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 24, 24, 3)]  0                                            
__________________________________________________________________________________________________
rnet_permute_1 (Permute)        (None, 24, 24, 3)    0           input_1[0][0]                    
__________________________________________________________________________________________________
rnet_conv_1 (Conv2D)            (None, 22, 22, 28)   784         rnet_permute_1[0][0]             
__________________________________________________________________________________________________
rnet_prelu_1 (PReLU)            (None, 22, 22, 28)   1           rnet_conv_1[0][0]                
__________________________________________________________________________________________________
rnet_maxpool_1 (MaxPooling2D)   (None, 11, 11, 28)   0           rnet_prelu_1[0][0]               
__________________________________________________________________________________________________
rnet_conv_2 (Conv2D)            (None, 9, 9, 48)     12144       rnet_maxpool_1[0][0]             
__________________________________________________________________________________________________
rnet_prelu_2 (PReLU)            (None, 9, 9, 48)     48          rnet_conv_2[0][0]                
__________________________________________________________________________________________________
rnet_maxpool_2 (MaxPooling2D)   (None, 4, 4, 48)     0           rnet_prelu_2[0][0]               
__________________________________________________________________________________________________
rnet_conv_3 (Conv2D)            (None, 3, 3, 64)     12352       rnet_maxpool_2[0][0]             
__________________________________________________________________________________________________
rnet_prelu_3 (PReLU)            (None, 3, 3, 64)     64          rnet_conv_3[0][0]                
__________________________________________________________________________________________________
rnet_flatten (Flatten)          (None, 576)          0           rnet_prelu_3[0][0]               
__________________________________________________________________________________________________
rnet_dense (Dense)              (None, 128)          73856       rnet_flatten[0][0]               
__________________________________________________________________________________________________
rnet_prelu_4 (PReLU)            (None, 128)          128         rnet_dense[0][0]                 
__________________________________________________________________________________________________
rent_branch_1 (Dense)           (None, 2)            258         rnet_prelu_4[0][0]               
__________________________________________________________________________________________________
softmax (Softmax)               (None, 2)            0           rent_branch_1[0][0]              
__________________________________________________________________________________________________
rnet_brnach_2 (Dense)           (None, 4)            516         rnet_prelu_4[0][0]               
==================================================================================================
Total params: 100,151
Trainable params: 100,151
Non-trainable params: 0
__________________________________________________________________________________________________
